# TODO: UMN AnyConnect / Cisco Secure Client: https://it.umn.edu/services-technologies/virtual-private-network-vpn
# TODO: Cricut Design Space: https://design.cricut.com/
# TODO: Huggle: https://github.com/huggle/huggle3-qt-lx/releases
# TODO: IntelliJ IDEs

tap "bsoyka/extras"
tap "dopplerhq/cli"
tap "homebrew/services"
tap "nrlquaker/createzap"

brew "chezmoi"
brew "cloc"
brew "dopplerhq/cli/doppler"
brew "enchant"
brew "exiv2"
brew "fish"
brew "gawk"
brew "git"
brew "glow"
brew "gnupg"
brew "httpie"
brew "libb2"
brew "libheif"
brew "mas"
brew "mise"
brew "openssl@3"
brew "scc"
brew "socat"
brew "tailscale"
brew "thefuck"
brew "tmux"
brew "tree"
brew "xz"
brew "zlib"

cask "1password"
cask "adobe-creative-cloud"
cask "affinity"
cask "altos" # from bsoyka/extras
cask "anki"
cask "appcleaner"
cask "audacity"
cask "bambu-studio"
cask "betterdisplay"
cask "cardhop"
cask "cloudmounter"
cask "comet"
cask "discord"
cask "fantastical"
cask "github"
cask "gpg-suite"
cask "grammarly-desktop"
cask "imageoptim"
cask "iterm2"
cask "keybase"
cask "label-live"
cask "logi-options+"
cask "middleclick"
cask "modrinth"
cask "obs"
cask "openrocket"
cask "prusaslicer"
cask "raycast"
cask "setapp"
cask "shottr"
cask "slack"
cask "spotify"
cask "tailscale-app"
cask "todoist-app"
cask "topaz-photo"
cask "vb-cable"
cask "visual-studio-code"
cask "zoom"
cask "zotero"

mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Crouton", id: 1461650987
mas "Deliveries", id: 290986013
mas "Flighty", id: 1358823008
mas "HP Smart", id: 1474276998
mas "Notability", id: 360593530
mas "TestFlight", id: 899247664

vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "asciidoctor.asciidoctor-vscode"
vscode "bajdzis.vscode-database"
vscode "benjaminbenais.copilot-theme"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "cweijan.epub-reader"
vscode "daltonmenezes.aura-theme"
vscode "dedsec727.jekyll-run"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "editorconfig.editorconfig"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "gerrythemes.gerrythemes"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.copilot"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "glenn2223.live-sass"
vscode "grapecity.gc-excelviewer"
vscode "hbenl.vscode-test-explorer"
vscode "james-yu.latex-workshop"
vscode "jock.svg"
vscode "lextudio.restructuredtext"
vscode "mark-wiemer.vscode-autohotkey-plus-plus"
vscode "marvhen.reflow-markdown"
vscode "maximeplante.vscode-pastery"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.jupyter"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "ocamllabs.ocaml-platform"
vscode "philnash.ngrok-for-vscode"
vscode "phr0s.bib"
vscode "pkief.material-icon-theme"
vscode "pranaygp.vscode-css-peek"
vscode "rebornix.ruby"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rubbersheep.gi"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "softwaredotcom.music-time"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tootone.org-mode"
vscode "trond-snekvik.simple-rst"
vscode "tyriar.windows-terminal"
vscode "ue.alphabetical-sorter"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "wingrunr21.vscode-ruby"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
