# TODO: UMN AnyConnect / Cisco Secure Client: https://it.umn.edu/services-technologies/virtual-private-network-vpn
# TODO: Cricut Design Space: https://design.cricut.com/
# TODO: Huggle: https://github.com/huggle/huggle3-qt-lx/releases
# TODO: IntelliJ IDEs

tap "bsoyka/extras"
tap "nrlquaker/createzap"

brew "chezmoi"
brew "cloc"
brew "doppler"
brew "enchant"
brew "exiv2"
brew "fish"
brew "gawk"
brew "git"
brew "glow"
brew "gnupg"
brew "httpie"
brew "libb2"
brew "libheif"
brew "mas"
brew "mise"
brew "openssl@3"
brew "scc"
brew "socat"
brew "tailscale"
brew "thefuck"
brew "tmux"
brew "tree"
brew "xz"
brew "zlib"

cask "1password"
cask "adobe-creative-cloud"
cask "affinity"
cask "altos" # from bsoyka/extras
cask "anki"
cask "appcleaner"
cask "audacity"
cask "bambu-studio"
cask "betterdisplay"
cask "cardhop"
cask "cloudmounter"
cask "comet"
cask "discord"
cask "fantastical"
cask "github"
cask "gpg-suite"
cask "grammarly-desktop"
cask "imageoptim"
cask "iterm2"
cask "keybase"
cask "label-live"
cask "logi-options+"
cask "middleclick"
cask "modrinth"
cask "obs"
cask "openrocket"
cask "orbstack"
cask "prusaslicer"
cask "raycast"
cask "setapp"
cask "shottr"
cask "slack"
cask "spotify"
cask "tailscale-app"
cask "todoist-app"
cask "topaz-photo"
cask "vb-cable"
cask "visual-studio-code"
cask "zoom"
cask "zotero"

mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Crouton", id: 1461650987
mas "Deliveries", id: 290986013
mas "Flighty", id: 1358823008
mas "HP Smart", id: 1474276998
mas "Notability", id: 360593530
mas "TestFlight", id: 899247664

vscode "aaron-bond.better-comments"
vscode "editorconfig.editorconfig"
vscode "gerrythemes.gerrythemes"
vscode "github.vscode-github-actions"
vscode "marvhen.reflow-markdown"
vscode "redhat.vscode-yaml"
vscode "ue.alphabetical-sorter"
vscode "yzhang.markdown-all-in-one"
